Repository: edutec/s4aWeb
Catalog: devdocs/s4aWeb-translation-ES/s4aWeb-translation-ES-level1.tmx
Source language: ca
Languages: es

source: Pots contactar amb nosaltres a scratch@citilab.eu per informar-nos de bugs o per a qualsevol suggerència.
es: Puedes contactar con nosotros en scratch@citilab.eu para informarnos sobre bugs o para cualquier sugerencia.

source: El nostre equip va crear i utilitzar aquests materials en un curs d'S4A a l'escola Elisava l'any 2011.
es: Nuestro equipo creó y utilizó estos materiales en un curso de S4A en la escuela Elisava durante el año 2011.

source: Essent programadors d'Smalltalk, vam poder modificar el seu codi font per aconseguir que interactués amb plaques Arduino.
es: Al ser programadores de Smalltalk, pudimos modificar su código fuente para conseguir que interactuara con placas Arduino.

source: Un exemple simple mostrant com activar un LED mitjançant un polsador.
es: Un ejemplo simple mostrando como activar un LED mediante un pulsador.

source: Aplicació web de prova
es: Aplicación web de prueba

source: Especificació dels missatges
es: Especificación de los mensajes

source: Arreglada la compatibilitat amb Arduino UNO a Linux (gràcies a Jorge Gómez).
es: Arreglada la compatibilidad con Arduino UNO en Linux (gracias a Jorge Gómez).

source: Traduccions al català i castellà millorades
es: Traducciones al catalán y castellano mejoradas

source: Es va inscriure al seu primer curs de programació l'any 1975, quan els ordinadors encara es programaven amb targetes perforades.
es: Se inscribió a su primer curse de programación en el año 1975, cuando los ordenadores todavía se programaban usando tarjetas perforadas.

source: L'sprite Arduino trobarà automàticament el port USB on s'hagi connectat la placa.
es: El sprite Arduino encontrará automáticamente el puerto USB en qué se haya conectado la placa.

source: Si us plau, consulteu la secció de Descàrregues per a més instruccions sobre l'instal·lació.
es: Por favor, consultad la sección de Descargas para más instrucciones sobre la instalación.

source: Protocol
es: Protocolo

source: Per formular preguntes i respostes, si us plau utilitzeu la llista de correu de la comunitat.
es: Para formular preguntas y respuestas, por favor utilitzad la lista de correo de la comunidad.

source: Aquí trobareu exemples bàsics d'S4A, amb els esquemes d'Arduino i un arxiu .sb amb el projecte Scratch per a descarregar.
es: Aquí encontraréis ejemplos básicos de S4A, con los esquemas de Arduino y un archivo .sb con el proyecto Scratch para descargar.

source: Hi trobareu uns quants exemples de casos d'ús del nostre software.
es: Encontraréis unos cuantos ejemplos de casos de uso de nuestro software.

source: L'aplicació Android utilitza un protocol molt senzill que hem desenvolupat sobre el protocol de missatges HTTP d'Scratch, la qual cosa permet interactuar amb S4A des d'un navegador o qualsevol altra aplicació amb accés a la xarxa.
es: La aplicación Android utiliza un protocolo muy sencillo que hemos desarrollado sobre el protocolo de mensajes HTTP de Scratch, la cual cosa permite interactuar con S4A desde un navegador o cualquier otra aplicación con acceso a la red.

source: Polsador, LED i conservació d'estat
es: Pulsador, LED y conservación de estado

source: La nostra motivació principal va ser proporcionar una manera senzilla per a interactuar amb el món real, aprofitant-nos de la facilitat d'ús d'Scratch.
es: Nuestra motivación principal fue proporcionar una forma sencilla para interactuar con el mundo real, aprovechándonos de la facilidad de uso de Scratch.

source: Aquí trobareu tota la documentació, vídeos, exemples i exercicis que hem produït fins ara.
es: Aquí encontraréis toda la documentación, vídeos, ejemplos y ejercicios que hemos producido hasta la fecha.

source: A S4A, activeu els sensors remots (clic dret a qualsevol bloc de "Sensors")
es: En S4A, activad los sensores remotos (clic derecho en cualquier bloque de "Sensores")

source: Equip
es: Equipo

source: Funcionarà S4A al meu ordinador?
es: ¿Funcionará S4A en mi ordenador?

source: Compatibilitat
es: Compatibilidad

source: Les variables d'S4A amb noms que no comencin amb els signes més o menys no són visibles des del client web
es: Las variables de S4A con nombres que no empiecen con los signos más o menos no son visibles desde el cliente web

source: Especificacions tècniques
es: Especificaciones técnicas

source: Canviats els noms del panell de sensors i els seus corresponents blocs d'Arduino per mostrar números de pin reals
es: Cambiados los nombres del panel de sensores y sus correspondientes bloques de Arduino para mostrar números de pin reales

source: Les variables d'S4A amb noms que comencin amb un signe més (ex.
es: Las variables de S4A con nombres que empiecen con un signo más (ej.

source: Documentació i exemples
es: Documentación y ejemplos

source: Canviat el pin 12 de servo estàndard a sortida digital normal
es: Cambiado el pin 12 de servo estándar a salida digital normal

source: En Joan és un biòleg que, en els seus primers anys, va treballar en el camp de l'ecologia.
es: Joan es un biólogo que, en sus primeros años, trabajó en el campo de la ecología.

source: IMPORTANT! Tant S4A com HiS4A han d'estar connectats a la mateixa xarxa local!
es: ¡IMPORTANTE! ¡Tanto S4A como HiS4A tienen que estar conectados a la misma red local!

source: No s'ha provat amb altres plaques, però és possible que també funcionin.
es: No se ha probado con otras placas, pero es posible que también funcionen.

source: +iniciarJoc) són visibles des del client web
es: +iniciarJuego) son visibles desde cliente web

source: Plaques compatibles
es: Placas compatibles

source: Quines plaques són compatibles amb S4A?
es: ¿Qué placas son compatibles con S4A?

source: Cal tenir en compte que aquesta compatibilitat no és bidireccional.
es: Téngase en cuenta que esta compatibilidad no es bidireccional.

source: Des d'aleshores, ha estat involucrat en diversos projectes de programació al Citilab.
es: Desde entonces, ha estado involucrado en varios proyectos de programación en el Citilab.

source: Pertany al grup de recerca LARCA i imparteix classes a la Facultat d'Informàtica de Barcelona.
es: Pertenece al grupo de investigación LARCA e imparte clases en la Facultat d'Informàtica de Barcelona.

source: Us trobareu davant de l'entorn clàssic d'una imatge d'Squeak 2.8, i tindreu accés a un Browser, Workspace i totes les eines a què esteu acostumats.
es: Os encontraréis delante de el entorno clásico de una imagen de Squeak 2.8, y tendréis acceso a un Browser, Workspace y todas las herramientas a qué estáis acostumbrados.

source: Un LED que canvia d'estat quan polsem un botó.
es: Un LED que cambia de estado al pulsar un botón.

source: Materials Taller Elisava 2011
es: Materiales Taller Elisava 2011

source: Afegides comandes de servidor al menú "Edita" per a treballar amb comunicació en xarxa sobre sockets
es: Añadidos comandos de servidor en el menú "Editar" para trabajar con comunicación en red sobre sockets

source: Aquí trobareu un recull de demos en català o castellà.
es: Aquí encontraréis una coleción de demos en catalán o castellano.

source: S4A habilita 6 entrades analògiques (pins analògics), 2 entrades digitals (pins digitals 2 i 3), 3 sortides analògiques (pins digitals 5, 6 i 9), 3 sortides digitals (pins 10, 11 i 13) i 4 sortides especials per a connectar servomotors de rotació contínua Parallax (pins digitals 4, 7, 8 i 12).
es: S4A habilita 6 entradas analógicas (pines analógicos), 2 entradas digitales (pines digitales 2 y 3), 3 salidas analógicas (pines digitales 5, 6 y 9), 3 salidas digitales (pines 10, 11 i 13) y 4 salidas especiales para conectar servomotores de rotación contínua Parallax (pines digitales 4, 7, 8 y 12).

source: Durant el temps que va treballar en aquesta empresa, va programar una àmplia varietat d'aplicacions.
es: Durante el tiempo en qué trabajó en esta empresa, programó una amplia variedad de aplicaciones.

source: Per accedir-hi, pitjeu majúscules + clic esquerre sobre el menú "Arxiu" d'S4A, i seleccioneu "Sortir del mode d'usuari".
es: Para acceder a él, pulsad mayúsculas + clic izquierdo sobre el menú "Archivo" de S4A, y seleccionad "Salir del modo de usuario".

source: Consta de dues plaques arduino (per al control remot i el robot), un mòdul wireless XBee, tres sensors d'infrarrojos, un mòdul de càmera i tres servomotors.
es: Consta de dos placas arduino (para el control remoto y el robot), un módulo wireless XBee, tres sensores de infrarojos, un módulo de cámara y tres servomotores.
